Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresSettings.ToolOptionNames.SingleScrews Field
 The single screws.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const string SingleScrews = "sel_single_screws"
Public Const SingleScrews As String = "sel_single_screws"
Field Value
Type: String
See Also
Reference
TeklaStructuresSettings.ToolOptionNames Class
Tekla.Structures Namespace